src/xiaofang.Dispatch-Append-Alert-Request.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:ns="urn:xiaofang">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns:Dispatch-Append-Alert-Request>
   <alert>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <group>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </group>
    <describe></describe>
    <level>Exigency</level>
    <alram-time></alram-time>
    <use-cars>0</use-cars>
    <create-time></create-time>
    <status>AlertActive</status>
   </alert>
   <acount>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <account-type>Dispatcher</account-type>
    <number></number>
    <short-number></short-number>
    <password></password>
    <service-status>AccountStop</service-status>
    <priority>0</priority>
    <call-privilege>CallForbid</call-privilege>
    <token-privilege>TokenForbid</token-privilege>
    <gps-report-mode>GpsManualPull</gps-report-mode>
    <ttl>0</ttl>
    <status>OffLine</status>
    <sip-status>OffLine</sip-status>
    <address>
     <ip></ip>
     <port>0</port>
    </address>
   </acount>
   <acount>
    <base>
     <id>0</id>
     <name></name>
     <entity-type>UNIT</entity-type>
     <parentid>0</parentid>
    </base>
    <account-type>Dispatcher</account-type>
    <number></number>
    <short-number></short-number>
    <password></password>
    <service-status>AccountStop</service-status>
    <priority>0</priority>
    <call-privilege>CallForbid</call-privilege>
    <token-privilege>TokenForbid</token-privilege>
    <gps-report-mode>GpsManualPull</gps-report-mode>
    <ttl>0</ttl>
    <status>OffLine</status>
    <sip-status>OffLine</sip-status>
    <address>
     <ip></ip>
     <port>0</port>
    </address>
   </acount>
  </ns:Dispatch-Append-Alert-Request>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
